Autodesk.Revit.DB.CellType
Declares the cell data type.
Since:
2011

Autodesk.Revit.DB.CellType.ParameterText
Read only parameter which only show formatted string

Autodesk.Revit.DB.CellType.CalculatedValue
the type is a calculated value

Autodesk.Revit.DB.CellType.CombinedParameter
the type is combined parameter

Autodesk.Revit.DB.CellType.Inherited
the type is inherited from the column or section if appropriate

Autodesk.Revit.DB.CellType.Parameter
Data bound parameter

Autodesk.Revit.DB.CellType.Graphic
Embedded graphic

Autodesk.Revit.DB.CellType.Text
Simple text